## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_federated_identity_credential.static_web_app_main_branch["events"] will be created
  + resource "azurerm_federated_identity_credential" "static_web_app_main_branch" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = "https://token.actions.githubusercontent.com"
      + name                = "gh-branch-main"
      + parent_id           = (known after apply)
      + resource_group_name = "rg-zenisu-events"
      + subject             = "repo:davidzenisu/page-form-collections:ref:refs/heads/main"
    }

  # azurerm_federated_identity_credential.static_web_app_pr["events"] will be created
  + resource "azurerm_federated_identity_credential" "static_web_app_pr" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = "https://token.actions.githubusercontent.com"
      + name                = "gh-pullrequest"
      + parent_id           = (known after apply)
      + resource_group_name = "rg-zenisu-events"
      + subject             = "repo:davidzenisu/page-form-collections:pull_request"
    }

  # azurerm_user_assigned_identity.static_web_app["events"] will be created
  + resource "azurerm_user_assigned_identity" "static_web_app" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "id-stapp-zenisu-events"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-zenisu-events"
      + tenant_id           = (known after apply)
    }

  # module.static_web_app["events"].azurerm_role_assignment.this["gh_identity"] will be created
  + resource "azurerm_role_assignment" "this" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/0766d027-cfc5-47ae-bd61-ebbc60fd1110/resourceGroups/rg-zenisu-events/providers/Microsoft.Web/staticSites/stapp-zenisu-events"
      + skip_service_principal_aad_check = false
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>